app/controllers/admin/promo_controller.rb

    def index
      @campaigns = PromotionalCampaign.order(created_at: :desc)
---
SELECT "promotional_campaigns".* FROM "promotional_campaigns" ORDER BY "promotional_campaigns"."created_at" DESC