app/controllers/admin/qr_codes_controller.rb

    def create
      count = params[:count].to_i || 2
      membership_type = params[:membership_type]

      qr_codes = ActiveRecord::Base.transaction do
        count.times.map do
          QrCode.create!(membership_type: membership_type)
---
INSERT INTO "qr_codes" ("code", "membership_type", "used_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["code", "rot-lljh-dre"], ["membership_type", "Recordandote"], ["used_at", nil], ["created_at", "2025-02-19 02:51:29.868709"], ["updated_at", "2025-02-19 02:51:29.868709"]]