app/controllers/api/v1/payments_controller.rb

INSERT INTO "customers" ("first_name", "last_name", "email", "phone", "address", "city", "province", "postal_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "orders" ("uuid", "customer_id", "membership_type", "amount", "status", "payment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
      def create_preference

        # Manejar las solicitudes OPTIONS preflight
        if request.method == "OPTIONS"
          return head :ok
        end

        # Obtiene los datos del formulario
        membership_type = params[:membershipType]
        first_name = params[:firstName]
        last_name = params[:lastName]
        email = params[:email]
        phone = params[:phone]
        address = params[:address]
        city = params[:city]
        province = params[:province]
        postal_code = params[:postalCode]

        # Genera un ID único para la orden
        order_id = SecureRandom.uuid

        # Obtiene los detalles de la membresía
        membership = get_membership_details(membership_type)

        # Crea la orden en la base de datos
        customer = Customer.create!(
          first_name: first_name,
          last_name: last_name,
          email: email,
          phone: phone,
          address: address,
          city: city,
          province: province,
          postal_code: postal_code
        )

        order = Order.create!(
          uuid: order_id,
          customer_id: customer.id,
          membership_type: membership_type,
          status: 'pending',
          amount: membership[:price]
        )

SELECT "orders".* FROM "orders" WHERE "orders"."uuid" = ? LIMIT ?  [["uuid", "821717e9-0174-4969-87a0-f47b355f8ca4"], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "payment_id" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", "completed"], ["payment_id", "106635534620"], ["updated_at", "2025-03-28 22:48:47.018086"], ["id", 3]]
---
      def webhook
        # Verifica la autenticidad de la notificación
        if params[:type] == "payment"
          payment_id = params[:data][:id]

          # Configura el SDK de Mercado Pago
          sdk = Mercadopago::SDK.new(ENV['MP_ACCESS_TOKEN'])

          # Obtiene la información del pago
          payment_response = sdk.payment.get(payment_id)

          if payment_response[:status] >= 200 and payment_response[:status] < 300
            payment_info = payment_response[:response]
            external_reference = payment_info['external_reference']
            status = payment_info['status']

            # Encuentra la orden correspondiente
            order = Order.find_by(uuid: external_reference)

            if order
              # Actualiza el estado de la orden según el estado del pago
              case status
              when "approved"
                order.update(status: "completed", payment_id: payment_id)

SELECT "orders".* FROM "orders" WHERE "orders"."uuid" = ? LIMIT ?  [["uuid", "123"], ["LIMIT", 1]]
---
      def order_status
        order = Order.find_by(uuid: params[:id])