app/controllers/memorials_controller.rb

INSERT INTO "memorials" ("user_id", "dob", "dod", "first_name", "last_name", "religion", "bio", "caption", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @memorial = current_user.memorials.new(memorial_params)

    if @memorial.save

UPDATE "memorials" SET "updated_at" = ? WHERE "memorials"."id" = ?  [["updated_at", "2025-02-20 12:18:06.231298"], ["id", 1]]
---
  def update
    if @memorial.update(memorial_params)

SELECT "memorials".* FROM "memorials" WHERE "memorials"."user_id" = ? AND "memorials"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_memorial
      @memorial = current_user.memorials.find(params[:id])