app/models/qr_code.rb

  def generate_code
    loop do
      self.code = generate_random_code
      break unless QrCode.exists?(code: code)
---
SELECT 1 AS one FROM "qr_codes" WHERE "qr_codes"."code" = ? LIMIT ?  [["code", "rot-lljh-dre"], ["LIMIT", 1]]